# GetSupportType Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSupport..::..GetSupportType Method
AnalyticalModelSupport Class See Also
---
Gets the type of support provided.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalyticalSupportType GetSupportType()
```

Visual Basic
---
```text
Public Function GetSupportType As AnalyticalSupportType
```

Visual C++
---
```text
public:
AnalyticalSupportType GetSupportType()
```

# ### Return Value
Indicates type of support provided.
# See Also
AnalyticalModelSupport Class
Autodesk.Revit.DB.Structure Namespace